app/controllers/results_controller.rb

  def search
    @releases = Release.search(params[:q].sub('.', '')).latest.find(:all,
      :include => [:ruby_gem => :authors]
    )
---
SELECT "authors".*, t0.ruby_gem_id as the_parent_record_id FROM "authors" INNER JOIN "authors_ruby_gems" t0 ON "authors".id = t0.author_id WHERE (t0.ruby_gem_id = 1)
SELECT * FROM "ruby_gems" WHERE ("ruby_gems"."id" = 1)